Load_Outputs/scenario1/100-30/summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
01 Homepage,100,118,84,325,43.70,0.000%,3.37075,8.36,0.86,2538.4
02 Stats API,100,2792,193,6055,1593.00,0.000%,2.83102,2.35,0.78,850.4
03 Search API (keyword search),100,2873,390,5690,1445.40,0.000%,2.53011,43.29,0.79,17520.1
04 Salary API (shown alongside search results),100,2863,106,5580,1386.37,0.000%,2.46342,2.09,0.71,867.9
05 Search API Filtered By Location,100,2782,384,5395,1220.57,0.000%,2.36362,61.09,0.78,26465.0
06 Job Describe API,100,2190,60,5141,1300.27,0.000%,2.40119,2.46,0.97,1048.1
07 Similar Jobs API,100,1938,56,5180,1445.61,0.000%,2.37411,1.82,0.99,786.5
08 Subscribe API,100,3057,52,30005,8981.85,100.000%,2.44033,2.50,1.19,1049.6
TOTAL,800,2327,52,30005,3519.37,12.500%,16.06006,100.23,5.55,6390.8